---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator.Reset
source: html/9a28747a-380a-c983-9346-9ff5a2bccf04.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator.Reset Method

Bring the iterator back to the start of the set.

## Syntax (C#)
```csharp
public virtual void Reset()
```

## Remarks
The Reset method will return the iterator back to the start of the set in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.